<code>$ mysql -h mysqldb.edu.cloudlab.com -u labuser --password=edureka

$ mysql --version

-- use your login id 6 digits to create database
$ mysql> drop database if exists sq121039; 
$ mysql> create database sq121039; 
$ mysql> use sq121039; 

$ mysql> create table employee(id int not null, name varchar(20) not null, age int not null, salary integer(10)); 
$ mysql> show tables; 

$ mysql> insert into employee values(1, 'Bill', 30, 10000); 
$ mysql> insert into employee values(2, 'Steve', 40, 12000); 
$ mysql> insert into employee values(3, 'Donald', 70, 13000); 
$ mysql> insert into employee values(4, 'Modi', 65, 9000); 
$ mysql> insert into employee values(5, 'Sundar', 50, 25000); 
$ mysql> insert into employee values(6, 'Jeff', 40, 30000); 
$ mysql> insert into employee values(7, 'Sergey', 45, 75000); 
$ mysql> insert into employee values(8, 'Larry', 45, 75000); 
$ mysql> insert into employee values(9, 'Xi', 50, 60000); 
$ mysql> commit; 
$ mysql> show tables; 
$ mysql> select * from employee; 
$ mysql> quit; </code>

# Import

$ <code>sqoop import --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka --table employee -m 1 -target-dir '/user/edureka_121039/sq121039_employees_1'</code>

### Verify output
* check hue for directory sq121039_employees and refer part-0000 file there
* hadoop fs -ls sq121039_employees
* hadoop fs -cat sq121039_employees/part-m-00000 | head -n 3

# Import with limit on number of records

$ <code>sqoop eval --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username labuser --password edureka --query 'Select * from employee limit 6'</code>

# Import using query

$CONDITIONS is mandatorily required in sqoop queries unless run using eval : https://stackoverflow.com/questions/35680370/sqoop-import-having-sql-query-with-where-clause

<code>$ sqoop import --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username labuser --password edureka --query 'Select * from employee where $CONDITIONS limit 6' -m 1 -target-dir '/user/edureka_121039/sq121039_employees_only6'</code>

# Incremental import

<code>$ sqoop import --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka --table employee -target-dir '/user/edureka_121039/sq121039_employees_only6' --incremental append --check-column id --last-value 8 -m 1</code>

# List databases

<code>$ sqoop list-databases --connect jdbc:mysql://mysqldb.edu.cloudlab.com/ --username=labuser --password=edureka
$ sqoop list-databases --connect jdbc:mysql://mysqldb.edu.cloudlab.com/edureka --username=labuser --password=edureka
$ sqoop list-databases --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka</code>

# List Tables

<code>$ sqoop list-tables --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka
$ sqoop list-tables --connect jdbc:mysql://mysqldb.edu.cloudlab.com/user --username=labuser --password=edureka</code>

# Eval

<code>$ sqoop eval --connect jdbc:mysql://mysqldb.edu.cloudlab.com/edureka --username=labuser --password edureka --query 'select table_schema, count(\*) from information_schema.tables group by 1 having count(\*) > 10 order by 2 desc'</code>

# Codegen
In object-oriented application, every database table has one Data Access Object class that contains ‘getter’ and ‘setter’ methods to initialize objects. Codegen generates the DAO class automatically. It generates DAO class in Java, based on the Table Schema structure.

<code>sqoop codegen --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka --table employee

$ cat /tmp/sqoop-edureka_121039/compile/3d27090393f130028a9a3908ee8c090e/employee.java
$ ls /tmp/sqoop-edureka_121039/compile/3d27090393f130028a9a3908ee8c090e/employee.jar</code>

# Export

<code>$ mysql> CREATE TABLE emp LIKE employee; -- creates a new empty table emp with same structure as employee
$ mysql> insert into emp select * from employee where id<7;
$ mysql> quit;
$ sqoop import-all-tables --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka
$ sqoop export --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka --table emp --export-dir /user/edureka_121039/sq121039_employees -m 1
</code>

### Verify export
<code>$ mysql -h mysqldb.edu.cloudlab.com -u labuser --password=edureka
$ mysql> use sq121039;
$ mysql> select * from emp;
</code>

sqoop export --connect jdbc:mysql://mysqldb.edu.cloudlab.com/sq121039 --username=labuser --password=edureka --table emp --export-dir /user/edureka_121039/sq121039_employees

In [ ]:
insert into employee values(3, 'Donald', 70, 13000); 
insert into employee values(4, 'Modi', 65, 9000); 
insert into employee values(5, 'Sundar', 50, 25000); 
insert into employee values(6, 'Jeff', 40, 30000); 
insert into employee values(7, 'Sergey', 45, 75000); 
insert into employee values(8, 'Larry', 45, 75000); 
insert into employee values(9, 'Xi', 50, 60000);